In [1]:
# dict -> Series

import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [2]:
# dict >> {k : v} >> dict_data 저장

dict_data = {'a' : 1, 'b' : 2, 'c' : 3}

# Series() 함수 > dict -> Series로 변환

sr = pd.Series(dict_data)

# sr의 자료형 출력
print(type(sr))
print('\n')

# 변수 sr에 저장되어 있는 시리즈 객체를 출력
print(sr)

<class 'pandas.core.series.Series'>


a    1
b    2
c    3
dtype: int64

In [3]:
# Series index

list_data = ['2022-12-13', '판다스', 170, True]
sr = pd.Series(list_data)

sr.index, sr.values

(RangeIndex(start=0, stop=4, step=1),
 array(['2022-12-13', '판다스', 170, True], dtype=object))

In [4]:
# Series element

tup = ('drwill', '2022-12-13', '남', True)
sr = pd.Series(tup, index = ['이름', '입학년도', '성별', '교강사여부'])

In [5]:
# 원소(element) 1개 선택

print(sr[0])
print(sr['이름'])

drwill
drwill

In [6]:
# 여러 개 원소를 선택 (인덱스 리스트 활용)

print(sr[[1,2]]) # 정수 위치 인덱스 활용
print()
print(sr[['입학년도', '성별']]) # 인덱스 이름 활용
print()

입학년도    2022-12-13
성별               남
dtype: object

입학년도    2022-12-13
성별               남
dtype: object

In [7]:
# 여러 개 원속 선택 (인덱스 범위 지정)

print(sr[1:2])
print()
print(sr['입학년도' : '성별'])

입학년도    2022-12-13
dtype: object

입학년도    2022-12-13
성별               남
dtype: object

In [8]:
# dict >> DataFrame

dict_data = {'a' :[1,2,3], 'b' : [4,5,6], 'c' : [7,8,9], 'd' : [10, 11, 12]}

df = pd.DataFrame(dict_data)
print(df)
print()
print(type(df))
print()
print(df.shape)

   a  b  c   d
0  1  4  7  10
1  2  5  8  11
2  3  6  9  12

<class 'pandas.core.frame.DataFrame'>

(3, 4)

In [9]:
# id, col 변경

df = pd.DataFrame([[25,'남','세싹 강동'],[23,'여','세싹 마포']],
                  index = ['보석', '주화'],
                  columns = ['나이', '성별', '교육기관'])
df

    나이 성별   교육기관
보석  25  남  세싹 강동
주화  23  여  세싹 마포

In [10]:
df.index

Index(['보석', '주화'], dtype='object')

In [11]:
df.values

array([[25, '남', '세싹 강동'],
       [23, '여', '세싹 마포']], dtype=object)

In [12]:
df.columns

Index(['나이', '성별', '교육기관'], dtype='object')

In [13]:
df.index = ['교육생 1번', '교육생 2번']
df.columns = ['연령', '남녀', '소속']

In [14]:
df

        연령 남녀     소속
교육생 1번  25  남  세싹 강동
교육생 2번  23  여  세싹 마포

In [15]:
# (***) rename

print(df.rename(index = {'교육생 1번' : '닥터윌', '교육생 2번' : '쯔위'}))
df

     연령 남녀     소속
닥터윌  25  남  세싹 강동
쯔위   23  여  세싹 마포

        연령 남녀     소속
교육생 1번  25  남  세싹 강동
교육생 2번  23  여  세싹 마포

In [16]:
df.rename(index = {'교육생 1번' : '닥터윌', '교육생 2번' : '쯔위'},inplace = True)
df

     연령 남녀     소속
닥터윌  25  남  세싹 강동
쯔위   23  여  세싹 마포

In [17]:
# 행삭제

exam = {
    '수학' : [90, 80, 70],
    '영어' : [98, 89, 95],
    '음악' : [85, 95, 100],
    '체육' : [100, 90, 90]    
}

df = pd.DataFrame(exam, index = ['보석', '주희', '동수'])
df

    수학  영어   음악   체육
보석  90  98   85  100
주희  80  89   95   90
동수  70  95  100   90

In [18]:
df2 = df[:]
df2.drop('동수',inplace = True)
df2

C:\Users\SBAUser\AppData\Local\Temp\ipykernel_6660\802502474.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df2.drop('동수',inplace = True)

    수학  영어  음악   체육
보석  90  98  85  100
주희  80  89  95   90

In [19]:
df3 = df[:]
df3.drop(['주희', '동수'], inplace = True)
df3

C:\Users\SBAUser\AppData\Local\Temp\ipykernel_6660\4066082419.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df3.drop(['주희', '동수'], inplace = True)

    수학  영어  음악   체육
보석  90  98  85  100

In [20]:
df4 = df[:]

df4.drop(['보석','동수'],axis = 0, inplace = True)

df4

C:\Users\SBAUser\AppData\Local\Temp\ipykernel_6660\2873397225.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df4.drop(['보석','동수'],axis = 0, inplace = True)

    수학  영어  음악  체육
주희  80  89  95  90

In [21]:
# 열 제거

df = pd.DataFrame(exam, index = ['보석','주희','동수'])

df

    수학  영어   음악   체육
보석  90  98   85  100
주희  80  89   95   90
동수  70  95  100   90

In [22]:
df5 = df.copy() # copy() 경고안뜸

df5.drop('수학', axis = 1, inplace = True)

df5

    영어   음악   체육
보석  98   85  100
주희  89   95   90
동수  95  100   90

In [23]:
df5.drop(['영어','음악'],axis=1, inplace = True)
df5

     체육
보석  100
주희   90
동수   90

In [24]:
exam

{'수학': [90, 80, 70],
 '영어': [98, 89, 95],
 '음악': [85, 95, 100],
 '체육': [100, 90, 90]}

In [25]:
df = pd.DataFrame(exam, index = ['kazuha', 'zzuyu', 'drwill'])
df

        수학  영어   음악   체육
kazuha  90  98   85  100
zzuyu   80  89   95   90
drwill  70  95  100   90

In [26]:
df.loc['kazuha']

수학     90
영어     98
음악     85
체육    100
Name: kazuha, dtype: int64

In [27]:
df.iloc[0]

수학     90
영어     98
음악     85
체육    100
Name: kazuha, dtype: int64

In [28]:
# 행 인덱스 사용, 2개 이상의 행 선택

df.loc[['zzuyu','drwill']]

        수학  영어   음악  체육
zzuyu   80  89   95  90
drwill  70  95  100  90

In [29]:
df.iloc[[0,1]]

        수학  영어  음악   체육
kazuha  90  98  85  100
zzuyu   80  89  95   90

In [30]:
# 행 인덱스의 범위 지정, 행 선택

df.loc['kazuha':'drwill']

        수학  영어   음악   체육
kazuha  90  98   85  100
zzuyu   80  89   95   90
drwill  70  95  100   90

In [31]:
df.iloc[0:]

        수학  영어   음악   체육
kazuha  90  98   85  100
zzuyu   80  89   95   90
drwill  70  95  100   90

In [32]:
df.iloc[0:2]

        수학  영어  음악   체육
kazuha  90  98  85  100
zzuyu   80  89  95   90

In [33]:
df['수학'], type(df['수학']) # Series

(kazuha    90
 zzuyu     80
 drwill    70
 Name: 수학, dtype: int64,
 pandas.core.series.Series)

In [34]:
df[['음악', '체육']], type(df[['음악','체육']])

(         음악   체육
 kazuha   85  100
 zzuyu    95   90
 drwill  100   90,
 pandas.core.frame.DataFrame)

In [35]:
df[['수학']], type(df[['수학']]) #DataFrame

(        수학
 kazuha  90
 zzuyu   80
 drwill  70,
 pandas.core.frame.DataFrame)

In [36]:
df['이름'] = ['kazuha','zzuyu','drwill']

# 이름 열을 새로운 idx로 지정, df 객체에 변경사항 적용
df.set_index('이름', inplace = True)

In [37]:
df.loc['kazuha', '음악']

85

In [38]:
df.iloc[0, 2]

85

In [39]:
df.loc['kazuha', ['음악', '체육']]

음악     85
체육    100
Name: kazuha, dtype: int64

In [40]:
df.iloc[0,[2,3]]

음악     85
체육    100
Name: kazuha, dtype: int64

In [41]:
df.loc['kazuha', '음악' : '체육']

음악     85
체육    100
Name: kazuha, dtype: int64

In [42]:
df.loc[['kazuha', 'drwill'], ['음악','체육']]

         음악   체육
이름
kazuha   85  100
drwill  100   90

In [43]:
df.iloc[[0,2],[2,3]]

         음악   체육
이름
kazuha   85  100
drwill  100   90

In [44]:
df.loc['kazuha' : 'zzuyu' , '음악' : '체육']

        음악   체육
이름
kazuha  85  100
zzuyu   95   90

In [45]:
df.iloc[:2 , 2:]

        음악   체육
이름
kazuha  85  100
zzuyu   95   90

reindex()함수

In [46]:
dict_data = {'c0' : [1,2,3], 'c1' : [4,5,6], 'c2' : [7,8,9], 'c3' : [10,11,12], 'c4' : [13,14,15]}

In [47]:
dict_data

{'c0': [1, 2, 3],
 'c1': [4, 5, 6],
 'c2': [7, 8, 9],
 'c3': [10, 11, 12],
 'c4': [13, 14, 15]}

In [48]:
df =pd.DataFrame(dict_data, index = ['r0','r1','r2'])
df

    c0  c1  c2  c3  c4
r0   1   4   7  10  13
r1   2   5   8  11  14
r2   3   6   9  12  15

In [49]:
new_index = ['r0','r1','r2','r3','r4']

df.reindex(new_index, fill_value = 0)

    c0  c1  c2  c3  c4
r0   1   4   7  10  13
r1   2   5   8  11  14
r2   3   6   9  12  15
r3   0   0   0   0   0
r4   0   0   0   0   0

In [50]:
dict_data

{'c0': [1, 2, 3],
 'c1': [4, 5, 6],
 'c2': [7, 8, 9],
 'c3': [10, 11, 12],
 'c4': [13, 14, 15]}

In [51]:
df

    c0  c1  c2  c3  c4
r0   1   4   7  10  13
r1   2   5   8  11  14
r2   3   6   9  12  15

In [52]:
# 인덱스를 정수형으로 초기화
ndf = df.reset_index()
ndf

  index  c0  c1  c2  c3  c4
0    r0   1   4   7  10  13
1    r1   2   5   8  11  14
2    r2   3   6   9  12  15

In [53]:
# index column 삭제
del ndf['index']
ndf

   c0  c1  c2  c3  c4
0   1   4   7  10  13
1   2   5   8  11  14
2   3   6   9  12  15

In [54]:
ndf = df.sort_index()
ndf

    c0  c1  c2  c3  c4
r0   1   4   7  10  13
r1   2   5   8  11  14
r2   3   6   9  12  15

In [55]:
# 내림차순 행 인덱스 정렬
ndf = df.sort_index(ascending = False)
ndf

    c0  c1  c2  c3  c4
r2   3   6   9  12  15
r1   2   5   8  11  14
r0   1   4   7  10  13

In [56]:
# sort_values()

df.sort_values(by = 'c1', ascending = False)

    c0  c1  c2  c3  c4
r2   3   6   9  12  15
r1   2   5   8  11  14
r0   1   4   7  10  13

산술연산

In [57]:
# Series > number

drwill = pd.Series({'국어' : 100, '영어' : 96, '수학' : 90})
print(drwill)

# 학생의 과목별 점수를 200으로 나누기

percentage = drwill/200
print(percentage)

국어    100
영어     96
수학     90
dtype: int64
국어    0.50
영어    0.48
수학    0.45
dtype: float64

In [58]:
# Series to Series

stu_1 = pd.Series({'국어' : 100, '영어' : 80, '수학' : 90})
stu_2 = pd.Series({'수학' : 80, '국어' : 90, '영어' : 80})

In [60]:
print(stu_1)
print(stu_2)

국어    100
영어     80
수학     90
dtype: int64
수학    80
국어    90
영어    80
dtype: int64

In [63]:
add = stu_1 + stu_2
sub = stu_1 - stu_2
mul = stu_1 * stu_2
div = stu_1 / stu_2

In [64]:
pd.DataFrame([add, sub, mul, div], index = ['덧셈', '뺄셈', '곱셈', '나눗셈'])

              국어        수학      영어
덧셈    190.000000   170.000   160.0
뺄셈     10.000000    10.000     0.0
곱셈   9000.000000  7200.000  6400.0
나눗셈     1.111111     1.125     1.0

In [66]:
# NaN 값 발생하는 사칙연산

stu_1 = pd.Series({'국어' : np.nan, '영어' : 80, '수학' : 90})
stu_2 = pd.Series({'수학' : 80, '국어' : 90})

In [67]:
print(stu_1)
print()
print(stu_2)

국어     NaN
영어    80.0
수학    90.0
dtype: float64

수학    80
국어    90
dtype: int64

In [68]:
add = stu_1 + stu_2
sub = stu_1 - stu_2
mul = stu_1 * stu_2
div = stu_1 / stu_2

In [69]:
pd.DataFrame([add, sub, mul, div], index = ['덧셈', '뺄셈', '곱셈', '나눗셈'])

     국어        수학  영어
덧셈  NaN   170.000 NaN
뺄셈  NaN    10.000 NaN
곱셈  NaN  7200.000 NaN
나눗셈 NaN     1.125 NaN

In [70]:
sr_add = stu_1.add(stu_2, fill_value = 0)
sr_sub = stu_1.sub(stu_2, fill_value = 0)
sr_mul = stu_1.mul(stu_2, fill_value = 0)
sr_div = stu_1.div(stu_2, fill_value = 0)

In [71]:
pd.DataFrame([sr_add, sr_sub, sr_mul, sr_div], index = ['덧셈', '뺄셈', '곱셈', '나눗셈'])

       국어        수학    영어
덧셈   90.0   170.000  80.0
뺄셈  -90.0    10.000  80.0
곱셈    0.0  7200.000   0.0
나눗셈   0.0     1.125   inf

In [72]:
import seaborn as sns

raw = sns.load_dataset('titanic')
raw

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [73]:
df = raw.copy()

In [75]:
# df+10 # 데이터 프레임 + 숫자
# TypeError: can only concatenate str (not "int") to str
# 숫자가 아닌 object 객체가 변수에 존재

In [76]:
df = df.loc[:,['age','fare']]

In [77]:
df

      age     fare
0    22.0   7.2500
1    38.0  71.2833
2    26.0   7.9250
3    35.0  53.1000
4    35.0   8.0500
..    ...      ...
886  27.0  13.0000
887  19.0  30.0000
888   NaN  23.4500
889  26.0  30.0000
890  32.0   7.7500

[891 rows x 2 columns]

In [78]:
df + 10 # 브로드캐스팅 : 데이터프레임의 원소에 접근, 하나씩 적용

      age     fare
0    32.0  17.2500
1    48.0  81.2833
2    36.0  17.9250
3    45.0  63.1000
4    45.0  18.0500
..    ...      ...
886  37.0  23.0000
887  29.0  40.0000
888   NaN  33.4500
889  36.0  40.0000
890  42.0  17.7500

[891 rows x 2 columns]

In [80]:
addition = df + 10

addition.tail()

      age   fare
886  37.0  23.00
887  29.0  40.00
888   NaN  33.45
889  36.0  40.00
890  42.0  17.75

In [81]:
# 데이터 프레임 끼리 연선

addition - df

      age  fare
0    10.0  10.0
1    10.0  10.0
2    10.0  10.0
3    10.0  10.0
4    10.0  10.0
..    ...   ...
886  10.0  10.0
887  10.0  10.0
888   NaN  10.0
889  10.0  10.0
890  10.0  10.0

[891 rows x 2 columns]